int/resources/objectRepo/xmlTemplates/opera/HotelConfig/req_CreateTemplateAmenities.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateTemplateAmenitiesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:TemplateAmenities>
            <v91:TemplateAmenity FeatureCode="?" OrderSequence="?">
               <v91:Description/>
               <v91:Comments/>
               <v91:AmenityType/>
               <v91:BeginDate/>
               <v91:EndDate/>
               <v91:NewChainCode/>
            </v91:TemplateAmenity>
         </v9:TemplateAmenities>
      </v9:CreateTemplateAmenitiesRQ>
   </soapenv:Body>
</soapenv:Envelope>